XuNeo/stm8-led-display/src/main.c
/**
  ******************************************************************************
  * @file    Project/main.c 
  * @author  MCD Application Team
  * @version V2.3.0
  * @date    16-June-2017
  * @brief   Main program body
   ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 


/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include "ezled.h"
#include "commands.h"

/* Private defines -----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

ezled_def ezled;  //ezled instance.
extern ezledif_def ezledif; //the led hardware defined in led

void command_set_blink(uint8_t *ppara, uint8_t len){
  if(ppara == 0) return;
  if(len != 1) return;
  ezled_set_blink(&ezled, *ppara);
}
void command_set_blink_speed(uint8_t *ppara, uint8_t len){
  if(ppara == 0) return;
  if(len != 1) return;
  ezled_set_blink_speed(&ezled, (led_speed_def)*ppara);
}
void command_set_scroll_speed(uint8_t *ppara, uint8_t len){
  if(ppara == 0) return;
  if(len != 1) return;
  ezled_set_scroll_speed(&ezled, (led_speed_def)*ppara);
}

void command_set_contrast(uint8_t *ppara, uint8_t len){
  if(ppara == 0) return;
  if(len != 1) return;
  ezled_set_contrast(&ezled, (ledcont_def)*ppara);
}

void command_print(uint8_t *ppara, uint8_t len){
  //case string to len
  char *pstr = (char*)ppara;
  if(ppara == 0) return;
  ppara[len] = '\0';
  ezled_print(&ezled, pstr);
}

void main(void)
{
  /* Initialization of the clock */
  /* Clock divider to HSI/1 */
  CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
  ezled_init(&ezled, &ezledif);
  commands_init();
  /* Enable general interrupts */  
  enableInterrupts();
  while (1)
  {
    ez_led_poll(&ezled);
  }
  
}

#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{ 
  volatile static u8 *pfile;
  volatile static u32 line_;
  line_ = line;
  pfile = file;
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
